app/views/orders/show.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1  [["order_id", 4]]
---
  <tbody>
  <% @order.line_items.each do |item| %>