app/controllers/sessions_controller.rb

  def create
    if (user = User.authenticate_with_credentials(params[:email], params[:password]))
      # success logic, log them in
      session[:user_id] = User.find_by_email(params[:email]).id
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "ifeolaifa5@gmail.com"]]